import React from "react";

export default function TermsPage(): JSX.Element {
  return (
    <div>
      <h1>利用規約</h1>
      <p>
        この規約は、IT KINGDOM（以下「弊社」とします）が企画・運営する「IT
        KINGDOM」のご利用にあたって、利用規約（以下「本規約」といいます）を定めたものです。IT KINGDOM
        の利用にあたっては、本規約に必ずご同意ください。ユーザーが、IT KINGDOM
        に登録又は利用した場合は、本規約の全ての記載内容について同意したものとみなされます。
      </p>
      <h2>第１条 規約</h2>
      <ol>
        <li>
          IT KINGDOM
          に関しては、本規約、その他弊社が定めるルール等（以下「ルール等」といいます）によって、その利用条件が規定されています。ルール等は名称によらずに本規約の一部を構成します。本規約は、ユーザーによる
          IT KINGDOM
          の利用の一切に適用されます。なお、大会ごとに主催者が定めるレギュレーション、注意事項等は、本規約には含まれません。
        </li>
        <li>
          本規約の規定とルール等の規定が異なる場合は、弊社が別途定める場合を除いて、ルール等の規定が優先して適用されます。
        </li>
        <li>
          ユーザーは本規約に従い、IT KINGDOM を利用するものとします。また、ユーザーが本規約に同意しない場合は、速やかに
          IT KINGDOM の利用を終了するものとします。
        </li>
      </ol>
      <h2>第２条 未成年について</h2>
      <ol>
        <li>
          ユーザーが未成年者である場合、IT KINGDOM の一切の利用について、親権者又は保護者の同意を得るものとします。
        </li>
        <li>
          ユーザーが未成年者である場合、賞金、賞品等(以下「賞金等」といいます）を受け取る場合には予め別途親権者又は保護者の同意を得るものとします。
        </li>
        <li>
          ユーザーが未成年者である場合、前二項の同意を得ている、年齢を成年と偽る等の詐術を用いた IT KINGDOM
          の利用について、IT KINGDOM に関する一切の法律行為を取り消すことができないものとします。
        </li>
      </ol>
      <h2>第３条 利用登録等</h2>
      <ol>
        <li>弊社は、IT KINGDOM を利用する各ユーザーを識別するための文字列を設定することがあります。</li>
        <li>
          ユーザーが IT KINGDOM
          を利用するには、ニックネーム、メールアドレス、パスワード等の登録、又は弊社が指定する第三者の発行する ID
          及びパスワードを求められることがあります。
        </li>
        <li>
          弊社は、IT KINGDOM
          を利用するにあたり登録した情報（以下「登録情報」といいます）が以下に該当すると判断した場合、当該ユーザーによる登録を承認しないこと、当該登録を削除すること又は弊社が適切と判断する措置を講ずることがあります。
        </li>
        <ol>
          <li>登録情報が第三者に嫌悪感を与える等の公序良俗に反する表現を含んでいる場合</li>
          <li>本規約に違反したことがある者からの利用登録である場合</li>
          <li>本規約に違反したことがある者からの招待による利用登録である場合</li>
          <li>第三者になりすますことを目的としている場合</li>
          <li>弊社の判断により､新規の利用を制限している場合</li>
          <li>前各号以外で、弊社が不適切な利用であると判断する場合</li>
        </ol>
        <li>ユーザーは、登録情報に変更があった場合には、速やかに弊社所定の方法で変更の届出をするものとします。</li>
        <li>
          前項の届出がないことによって、第三者が不利益又は損害を被った場合は、当該ユーザーがその損害を賠償するものとします。
        </li>
      </ol>
      <h2>第４条 登録情報</h2>
      <ol>
        <li>ユーザーは、登録情報について、自己の責任の下、登録及び管理するものとします。</li>
        <li>
          弊社は、ユーザーが登録情報を失念、削除、不正確又は虚偽であったためにユーザーが被った不利益及び損害に関して、責任を負わないものとします。
        </li>
        <li>
          ユーザーは、弊社の事前の同意なく登録情報を第三者に利用させたり、貸与、譲渡、売買、質入、公開等をすることはできません。
        </li>
        <li>
          弊社は、登録情報によって IT KINGDOM
          の利用があった場合、利用登録を行ったユーザー本人が利用したものと扱うことができ、当該利用によって生じた結果については、利用登録を行ったユーザー本人に帰属するものとします。
        </li>
        <li>
          ユーザーによる登録情報の管理が不十分であったために第三者が登録情報を不正使用した場合、ユーザーに不利益又は損害が生じても、弊社は責任を負わないものとします。
        </li>
        <li>
          前項の第三者の不正使用により、弊社又は第三者に損害が生じた場合、ユーザーは弊社及び損害を被った第三者に対し、損害を賠償するものとします。
        </li>
        <li>ユーザーは、登録情報を第三者に不正に使用される可能性がある場合は、速やかに弊社に通知するものとします。</li>
      </ol>
      <h2>第５条 IT KINGDOM について</h2>
      <ol>
        <li>
          IT KINGDOM
          を利用して開催される大会は、大会ごとに主催及び運営が異なります。ユーザーは、自ら主催及び運営を事前に確認した上で参加するものとします。
        </li>
        <li>ユーザーは、主催者が大会ごとに指定する手続及び条件でのみ参加することができるものとします。</li>
        <li>
          弊社は、大会を主催者が任意の理由で、大会
          (開催中の大会も含む)の内容、レギュレーション、注意事項、運用等の修正、追加、変更、中断、中止、終了等を行ったとしても関与しないものとします。
        </li>
      </ol>
      <h2>第６条 IT KINGDOM の修正等</h2>
      <p>
        弊社は、弊社の都合により、ユーザーに通知することなく、いつでも任意の理由で IT KINGDOM
        について修正、追加、変更、中断、終了、運営を第三者に委託、又は IT KINGDOM
        を第三者に譲渡することができます。この場合、ユーザーに発生した損害について、弊社は一切の責任を負わないものとします。
      </p>
      <h2>第７条 個人情報について</h2>
      <ol>
        <li>弊社は、ユーザーから取得した個人情報の保護に最大限の注意を払います。</li>
        <li>
          IT KINGDOM
          において、弊社が複数のユーザー間でメッセージの投稿又は掲示板への投稿を行う機能を設定した場合、ユーザー自身が投稿した個人情報、又は他のユーザーが投稿した当該ユーザーに関する個人情報が、他のユーザー又は第三者に知られることとなり、また利用されることになったとしても、弊社は一切の責任を負いません。
        </li>
        <li>
          弊社は、ユーザーの個人情報を以下の目的で利用することができるものとし、ユーザーはあらかじめこれに同意するものとします。
        </li>
        <ol>
          <li>本人確認のため</li>
          <li>賞金等の提供のため</li>
          <li>アイテムの付与のため</li>
          <li>アフターサービス、問い合わせのため</li>
          <li>IT KINGDOM に関するお知らせ、その他の弊社のサービスに関する情報の提供のため</li>
          <li>第三者の商品又はサービスに関する広告を提供するため</li>
          <li>アンケート、懸賞、キャンペーンの実施のため</li>
          <li>マーケティング調査、統計、分析のため</li>
          <li>規約、条件、ポリシーの変更等の通知を連絡するため</li>
          <li>その他弊社が運営する各サービスにおいて定める目的のため</li>
        </ol>
        <li>弊社は、個人情報の取扱い業務の一部を他社に委託する場合があります。</li>
        <li>
          弊社は、以下の場合には、ユーザーの個人情報を第三者に提供することができるものとし、ユーザーは予めこれに同意するものとします。
        </li>
        <ol>
          <li>個人情報の開示、利用についてユーザーの同意がある場合</li>
          <li>ユーザーが希望するサービスを提供するために、第三者に対し個人情報の開示が必要と認められる場合</li>
          <li>弊社又は第三者の広告、サービス等に関する情報を、ユーザーに送信する場合</li>
          <li>IT KINGDOM の向上、弊社の事業開発、マーケティング等の目的で登録情報を集計又は分析等する場合</li>
          <li>個人情報の取扱業務を他社に委託する場合</li>
          <li>裁判所、検察庁、警察又はこれらに準ずる権限を有する公的機関から正当に開示を求められた場合</li>
          <li>
            国の機関もしくは地方公共団体又はその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがある場合
          </li>
          <li>人の生命、身体及び財産等に対する差し迫った危険があり、緊急の必要性がある場合</li>
          <li>公衆衛生の向上又は青少年の健全な育成の推進のために特に必要がある場合</li>
          <li>合併、営業譲渡その他の事由による事業の承継の際に、事業を承継する者に対して開示する場合</li>
        </ol>
        <li>弊社は、個人情報を、個人情報保護管理者の統括の下、管理します。</li>
        <li>
          ユーザーは、個人情報に関する利用目的の通知、開示、内容の訂正/追加/削除、利用の停止、消去又は第三者への提供停止の請求を個人情報保護方針に記載された方法によりおこなうことができます。
        </li>
        <li>
          個人情報の登録は任意ですが必要な個人情報を登録頂けない場合は、IT KINGDOM
          の利用に支障が発生する場合があります。
        </li>
        <li>
          その他、弊社のプライバシーに対する考え方の詳細については、 プライバシーポリシー を参照してください。
          <a target="_blank" rel="noopener noreferrer" href="https://IT KINGDOM.app/support/privacy-policy">
            https://IT KINGDOM.app/support/privacy-policy
          </a>
        </li>
      </ol>
      <h2>第８条 同意事項</h2>
      <ol>
        <li>
          弊社は、IT KINGDOM
          に弊社又は第三者の広告を掲載することができるものとし、ユーザーはこれに同意するものとします。
        </li>
        <li>
          弊社は、ユーザーの青少年の健全な利用を推進、ユーザーの第９条の禁止行為等本規約の遵守状況の確認及び IT KINGDOM
          の改善、向上を目的として、ユーザーが投稿したコメント、テキスト、画像等(以下、「投稿情報」といいます)の内容を閲覧及び記録をすることができるものとし、ユーザーはこれに同意するものとします。
        </li>
        <li>
          弊社は、投稿情報の内容を確認し、法令・利用規約・公序良俗等に反する、青少年の健全な利用に反する又はその他不適切な利用であると弊社が判断した場合には、ユーザー又は第三者が当該投稿情報等の内容を閲覧する前か否かに関わらず、当該投稿情報等の全部若しくは一部を削除、停止、あるいは裁判所・警察等の公的機関に開示・提供する等の弊社が適切と判断する措置を行うことができるものとし、ユーザーはこれに同意するものとします。
        </li>
        <li>
          弊社は、本条第 2
          項の目的の実現のために、投稿情報の内容を、個人を特定する情報を削除し、機密保持契約を締結した上で、業務提携している会社及び監視会社等に内容を公開することができるものとし、ユーザーはこれに同意するものとします。
        </li>
        <li>
          弊社は、ユーザーが IT KINGDOM
          のリンク等を通じて弊社以外のサービスを利用する場合には、ユーザーの責任で利用するものとし、ユーザーはこれに同意するものとします。
        </li>
        <li>
          弊社は、ユーザーが IT KINGDOM 及び IT KINGDOM
          によって表示される広告等を閲覧、利用等したことによって得られた個人を特定しない情報を集計、分析し、その結果を、弊社、広告を
          IT KINGDOM に提供している第三者及び弊社と業務提携している会社の事業開発、マーケティング、IT KINGDOM
          の改善・向上等の目的で利用することに、ユーザーは同意するものとします。
        </li>
        <li>
          ユーザーが、IT KINGDOM を利用することにより、弊社又は他のユーザー等の第三者に対し損害を与えた場合、
          ユーザーは自己の費用と責任において生じた損害の一切を賠償する必要があることに予め同意するものとします。
        </li>
        <li>
          ユーザー又は別途弊社が指定した会社/個人が主催者となる大会に参加した場合、ユーザーの責任で利用するものとし、弊社が一切責任を負わないことに同意するものとします。
        </li>
      </ol>
      <h2>第９条 禁止行為</h2>
      <ol>
        <li>
          ユーザーは、以下の行為又はそのおそれがある行為を行ってはならないものとします。
          <ol>
            <li>法令又は公序良俗に反する行為</li>
            <li>犯罪行為の全部又は一部をなす行為</li>
            <li>
              暴力的、グロテスク、その他一般的に不快を感ずる文章、画像、図画、イメージ、その他の表現及び情報等の投稿する行為
            </li>
            <li>ストーキング行為を行う等の第三者に対する嫌がらせ行為</li>
            <li>
              他のユーザー又は第三者を差別もしくは誹謗中傷し、又はその信用、名誉、プライバシー権、肖像権その他一切の権利を侵害する行為
            </li>
            <li>
              弊社又は第三者の特許権、実用新案権、意匠権、商標権、著作権、技術上もしくは営業上のノウハウその他の権利、又はこれらの権利に基づく実施権等の権利を侵害する行為
            </li>
            <li>他のユーザー又は第三者の個人情報を投稿又は掲載する行為</li>
            <li>わいせつな表現、アダルト画像・図画、又は露出度の高い画像・図画を投稿する行為</li>
            <li>アダルトサイト、出会い系サイト、年齢制限を有するサイト等への誘導、リンクさせる行為</li>
            <li>政治的活動、宗教活動、宗教団体への勧誘する行為</li>
            <li>異性交際を求める/求めに応じる等の不適切な交際を促進する行為</li>
            <li>登録情報において、実在する第三者の人物・団体名などを登録する行為</li>
            <li>他のユーザー又は第三者になりすまして IT KINGDOM を利用する行為</li>
            <li>連鎖講（マルチ商法、ねずみ講、マルチまがい商法）などに類する勧誘・取引行為</li>
            <li>
              IT KINGDOM 内の機能、IT KINGDOM 内の機能の操作、その他 IT KINGDOM
              に関する一切の事由について、現実の通貨で売買する行為
            </li>
            <li>IT KINGDOM のサーバー又はネットワークに悪意をもって負荷をかける行為</li>
            <li>チートツール、BOT、その他の技術を利用して IT KINGDOM を不正に操作する行為</li>
            <li>IT KINGDOM に発生した不具合を意図的に利用する行為</li>
            <li>ジェイルブレイク等、端末に対して改変を行った状態での IT KINGDOM へのアクセス行為</li>
            <li>
              IT KINGDOM
              の全部又は一部を複製もしくは改変する行為、又は逆コンパイル等のリバースエンジニアリングをする行為
            </li>
            <li>IT KINGDOM を第三者に再配布する行為</li>
            <li>IT KINGDOM に関するウェブサイト上の情報を改ざん、又は消去する行為</li>
            <li>他のユーザー又は第三者をコンピューター・ウイルスに感染させる行為</li>
            <li>その他 IT KINGDOM にて弊社が不正と判断する行為</li>
            <li>その他弊社が不適切と判断する行為</li>
          </ol>
        </li>
        <li>
          弊社は、ユーザーが前項各号の行為を行った又は本規約に違反した場合、当該ユーザーの IT KINGDOM
          の利用制限、利用停止、利用禁止、投稿情報の削除、登録情報の削除等の弊社が適切と判断する措置を行うことができるものとします。
        </li>
        <li>
          弊社は、本条第 1
          項各号の行為をユーザーが行うこと、又は受けることによって、他のユーザー又は第三者との間でトラブルが生じた場合、当該ユーザーは、自己の責任と費用においてこれを解決し、弊社は一切の責任を負わないものとします。この場合において、弊社又は第三者が何らかの損害を被ったときは、当該ユーザーは弊社及び当該第三者に対して損害の賠償をしなければならないものとします。
        </li>
      </ol>
      <h2>第１０条 免責事項</h2>
      <ol>
        <li>
          ユーザーは、自己責任において IT KINGDOM を利用するものとします。弊社は、IT KINGDOM
          を利用してなされた一切の行為及びその結果について一切の責任を負わないものとします。
        </li>
        <li>
          弊社は、ユーザーによる IT KINGDOM の不正利用又は不適切な利用について監視する義務を負わないものとします。
        </li>
        <li>
          弊社は、IT KINGDOM 及び IT KINGDOM
          に関連して提供されるデータ（ユーザーによるメッセージ投稿及び掲示板への投稿を含む）について、完全性、正確性、信頼性、有用性、合法性、道徳性等に関する保証を含め、一切の責任を負わないものとします。
        </li>
        <li>
          IT KINGDOM 上にて掲載された広告の内容はすべて広告主が責任を負い、IT KINGDOM
          上もしくは遷移先問わず当該内容について真偽の判断はユーザーの自己責任において行うものとし、弊社はそれによって生じた事項について、一切の責任を負わないものとします。
        </li>
        <li>
          弊社は、IT KINGDOM
          及び提携先又は広告主等を含む第三者のウェブサイトからのダウンロードやコンピューター・ウイルス感染等により発生した損害について、賠償する義務を一切負わないものとします。
        </li>
        <li>
          弊社は、IT KINGDOM
          に関するシステム障害、通信障害、停電、火災、自然災害、戦争、内乱、暴動、労働争議等の発生により IT KINGDOM
          の正常な運営が不能となった場合であっても、それによってユーザーに生じた損害について、一切の責任を負わないものとします。
        </li>
        <li>
          弊社は、ユーザーが利用しているインターネット接続サービス及び端末の利用制限、中断、速度の低下、機能低下等によってユーザーに生じた損害について、一切の責任を負わないものとします。
        </li>
      </ol>
      <h2>第１１条 ユーザー間等のトラブル</h2>
      <p>
        ユーザー間又はユーザーと主催者等の第三者との間で生じたトラブルについては、ユーザーは自己の責任で解決しなければならず、弊社はこれらのトラブルに関して、一切の責任を負いません。
      </p>
      <h2>第１２条 知的財産権の帰属</h2>
      <p>
        IT KINGDOM に関する特許権、実用新案権、意匠権、著作権等（著作権法第 27 条及び第 28
        条に規定する権利を含む。以下本条において総称して「知的財産権」といいます）は、弊社又は正当な権利を有する第三者に帰属します。
      </p>
      <h2>第１３条 賞金等について</h2>
      <ol>
        <li>
          弊社は、大会ごとに決定した賞金等を弊社が設定した方法、時期等のルールに基づき、ユーザーに対して提供することがあります。
        </li>
        <li>
          弊社は、ユーザーに賞金等を提供する際に源泉所得税等を徴収する必要が法律上ある場合、賞金等から源泉所得税等を控除した金額をユーザーに対して提供するものとします。
        </li>
        <li>
          弊社は、ユーザーが賞金等を受け取ることができる期間（以下「受取期間」といいます）を定めることができるものとします。弊社は当該期間経過後には提供する義務を負わないものとします。
        </li>
        <li>
          弊社は、IT KINGDOM
          を終了、譲渡等をすることになった場合に、別途受取期間を設定し、受取期間を経過後には賞金等を提供する義務を負わないものとします。
        </li>
        <li>
          弊社者は、以下の場合にはユーザーの賞金等の受け取る権利を放棄したものとみなし、賞金等を提供する義務を免れるものとし、ユーザーはこれを了承するものとします。
        </li>
        <ol>
          <li>ユーザーが本規約に違反した場合</li>
          <li>登録情報をもって弊社又は主催者と一定期間以上連絡が取れない場合</li>
          <li>その他弊社が支払うことが困難と合理的に判断する場合</li>
        </ol>
      </ol>
      <h2>第１４条 ユーザーへの通知</h2>
      <ol>
        <li>
          弊社からの通知を、IT KINGDOM 上に表示することにより行う場合は、弊社が IT KINGDOM
          上に通知を表示したときに、ユーザーに通知が到達したものとみなします。
        </li>
        <li>
          弊社からの通知を、弊社に登録されたメールアドレス等に送信することにより行う場合は、通常到達すべきときに、ユーザーに通知が到達したものとみなします。
        </li>
        <li>
          弊社からの通知を、チャット機能又はプッシュ通知により行う場合は、通常到達すべきときに、ユーザーに通知が到達したものとみなします。
        </li>
      </ol>
      <h2>第１５条 権利義務の譲渡の禁止</h2>
      <p>
        ユーザーは、IT KINGDOM
        に関するユーザー資格、ユーザー資格に基づく権利義務の一切を、第三者に譲渡し又は担保に供してはならないものとします。
      </p>
      <h2>第１６条 利用停止等</h2>
      <ol>
        <li>
          弊社は、以下の各号に掲げる場合は、ユーザーに事前に通知又は催告することなく、IT KINGDOM
          の利用制限、又は利用停止させることができるものとします。
          <ol>
            <li>
              ユーザーによる IT KINGDOM
              を含む弊社のサービスの利用に関し他のユーザー又は第三者から弊社にクレーム、請求等がなされ、かつ弊社が必要と認めた場合
            </li>
            <li>ユーザーが不正又は弊社の予定していない方法により賞金等を獲得又は受け取った場合</li>
            <li>ユーザーが反社会勢力に該当しもしくは該当していたことが判明した場合</li>
            <li>IT KINGDOM の保守のために必要な場合</li>
            <li>IT KINGDOM のシステムに不具合があった場合</li>
            <li>その他本規約に違反する行為があった場合</li>
          </ol>
        </li>
        <li>弊社はユーザーに対して、前項の措置を講じた理由を開示する義務を負わないものとします。</li>
        <li>
          ユーザーが第 1 項各号（第 4 号、第 5
          号を除く）のいずれかに該当することにより弊社が損害を被った場合、弊社は当該ユーザーに対して損害の賠償を請求できるものとします。
        </li>
      </ol>
      <h2>第１７条 利用終了</h2>
      <ol>
        <li>
          弊社は、ユーザーが利用を終了した場合、そのユーザーの利用履歴、投稿情報、登録情報、個人情報、賞金等獲得情報等のデータ等を引き続き保有する義務はないものとします。
        </li>
        <li>
          ユーザーが自らの意志による利用を終了した場合でも、本規約に同意していることには変更はなく、規約は適用されるものとします。
        </li>
      </ol>
      <h2>第１８条 規約の改定について</h2>
      <p>
        弊社は、ユーザーの了解を得ることなく本規約を変更できるものとします。この場合、弊社が別途定める場合を除き、変更後の規約は
        IT KINGDOM 上に表示した時点より効力を生じるものとします。
      </p>
      <h2>第１９条 本規約の有効性</h2>
      <ol>
        <li>
          本規約が消費者契約法に定める消費者契約に該当する場合には、本規約のうち、弊社の損害賠償責任を完全に免責する規定は適用されないものとします。
        </li>
        <li>
          弊社は、前項において、ユーザーに発生した損害が債務不履行又は不法行為に基づくときは、当該ユーザーが直接かつ現実に被った損害を上限として、当該ユーザーから受領した料金の範囲で損害賠償責任を負い、特別損害については責任を負わないものとします。
        </li>
        <li>
          本規約が法令に違反する場合、本規約のうち法令に違反する条項のみが無効であり、その他の条項は有効に存続するものとします。
        </li>
        <li>
          本規約が特定のユーザーとのあいだで、一部無効、もしくは取り消しになった場合でも、本規約は他のユーザーとの関係では有効であるとします。
        </li>
      </ol>
      <h2>第２０条 準拠法・裁判管轄</h2>
      <ol>
        <li>本規約は、日本法に従って解釈されます。</li>
        <li>
          弊社とユーザーとの紛争については、日本法を準拠法とし、訴額に応じて東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とします。
        </li>
      </ol>

      <time>2020 年 07 月 24 日 改定</time>

      <style jsx>{`
        div {
          width: min(100%, 740px);
          margin: 0 auto;
          padding: 2em 10px;
          font-size: 14px;
          color: var(--c-primary-level7);
        }
        h1 {
          font-size: 1.4em;
          text-align: center;
          margin-bottom: 1em;
        }
        h2 {
          font-size: 1.2em;
          margin-top: 2em;
        }
        p,
        ul,
        ol {
          margin: 0.5em 0;
        }
        ul {
          list-style: unset;
          padding-left: 1.5em;
        }
        ol {
          list-style: decimal;
          padding-left: 1.5em;
        }
        ol ol {
          list-style: lower-alpha;
        }
        time {
          display: block;
          padding-top: 2em;
          text-align: right;
        }
      `}</style>
    </div>
  );
}
